<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
 
 <!-- 
 	 프레임워크 
	 	 - 개발자가 보다 편리한 환경에서 개발할 수 있도록 제공하는 뼈대
	 	 - 소프트웨어 개발의 입장으로서는 공통으로 사용하는 라이브러리 및 개발도구, 인터페이스 등등을 의미
 	 
 	 왜 프레임워크를 사용하는 지?
	 	 - 현재 웹프로그래밍의 규모가 커지고있음
	 	 => 거대하고 복잡도가 높은 프로젝트를 완성시키기위해 많은 사람들이 필요함
	 	 => 그 개발자들이 "통일성"있고, "빠르며", "안정적"이게 개발하기위한 도구로 프레임워크가 좋은 성과를 내고있음
	 	 => 즉, 생산성 향상에 도움이 된다.
 	 
 	 * 프레임워크의 특징
 	 	- 자유롭게 설계하고, 코딩하는게 아니라 프레임워크가 제공하는 가이드대로 설계하고, 코딩해야함
 	 	- 개발할 수 있는 범위가 정해져있음 -> 한정범위안에 고성능인 개발을 할 수 있다.
 	 	- 개발자를 위한 다양한 도구 / 플러그인들이 지원됨
 	 
 	 * 프레임워크의 장단점
	 	 > 장점 
	 	 	개발시간 감소
	 	 	오류로부터 조금 자유로워짐 -> 자신의 부주의로 인한 오류는 어쩔 수 없음
	 	 
	 	 > 단점 
	 	 	너무 의존하면, 개발능력이 떨어져서 프레임워크 없이 개발하는 것이 어려워짐
	 	 	습득하는 데 시간이 다소 걸림
 	 
 	 * 프레임워크의 종류
	 	 - 영속성		: 데이터 관련한 (CRUD)기능들을 편리하게 작업할 수 있도록 하는 프레임워크(MyBatis)
	 	 - 자바		: 웹 어플리케이션에 초점을 맞춰 필요한 요소들을 모듈화해서 제공해주는 프레임워크(Spring)
	 	 - 화면구현	: Front-end를 보다 쉽게 구현할 수 있게 틀을 제공해주는 프레임워크(Bootstrap)
	 	 - 기능 및 지원	: 특정기능이나 업무 수행에 도움을 주는 기능을 제공해주는 프레임워크(Log4j)
  -->
  
 
  <!-- index페이지가 로딩되자마자 main.jsp로 포워딩된다. -->
  <jsp:forward page="views/main.jsp"></jsp:forward>
 
 
</body>
</html>